# -*- coding: utf-8 -*-
"""Untitled44.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1NLWa0rwhNLZqPGIn3NJNJ8a7mdn9g84w
"""

# Даны целые числа a,b,c. Проверить истинность высказывания : "Сущевствует
# треугольник со сторонами a,b,c"
a = int(input('введите первое число ')) #ввод данных
b = int(input('введите первое число '))
c = int(input('введите первое число '))

try:
 if a != b != c != a : # проверка
  print(True)# вывод если True
 else:
  print(False)# вывод если False
except:
 print('Ошибка!')